{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "percentageSoilSensor2"}, "name": "percentageSoilSensor2", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "roomHumidity"}, "name": "roomHumidity", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "roomTemperature"}, "name": "roomTemperature", "inbound_nodes": []}, {"class_name": "Normalization", "config": {"name": "normalization_3", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_3", "inbound_nodes": [[["percentageSoilSensor2", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_4", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_4", "inbound_nodes": [[["roomHumidity", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_5", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_5", "inbound_nodes": [[["roomTemperature", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["normalization_3", 0, 0, {}], ["normalization_4", 0, 0, {}], ["normalization_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["dense_8", 0, 0, {}]]]}], "input_layers": [["percentageSoilSensor2", 0, 0], ["roomHumidity", 0, 0], ["roomTemperature", 0, 0]], "output_layers": [["dense_9", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_7/kernel", "shape": [3, 32], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_9/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_9/bias", "shape": [1], "dtype": "float32"}, {"name": "normalization_3/mean", "shape": [1], "dtype": "float32"}, {"name": "normalization_3/variance", "shape": [1], "dtype": "float32"}, {"name": "normalization_3/count", "shape": [], "dtype": "int32"}, {"name": "normalization_4/mean", "shape": [1], "dtype": "float32"}, {"name": "normalization_4/variance", "shape": [1], "dtype": "float32"}, {"name": "normalization_4/count", "shape": [], "dtype": "int32"}, {"name": "normalization_5/mean", "shape": [1], "dtype": "float32"}, {"name": "normalization_5/variance", "shape": [1], "dtype": "float32"}, {"name": "normalization_5/count", "shape": [], "dtype": "int32"}]}]}